salary_backend/app/controllers/EmployeesController.rb

SELECT "employees".* FROM "employees" ORDER BY "employees"."id" DESC
---
  def index
    employees = Employee.order(:id)

INSERT INTO "employees" ("full_name", "email", "job_title", "country", "salary", "department", "hire_date", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    employee = Employee.new(employee_params)
    if employee.save

UPDATE "employees" SET "salary" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["salary", 323.0], ["updated_at", "2026-04-29 11:53:06.797955"], ["id", 10001]]
---
  def update
    if @employee.update(employee_params)