salary_backend/app/controllers/InsightsController.rb

    scope = scope.where(country: country) if country.present?

    data = {
      total_employees: scope.count,
      min_salary: scope.minimum(:salary),
      max_salary: scope.maximum(:salary),
      avg_salary: scope.average(:salary).to_f.round(2)
    }

    if country.present? && job_title.present?
      job_scope = Employee.where(country: country, job_title: job_title)

      data[:job_title_avg_salary] =
        job_scope.average(:salary).to_f.round(2)
---
SELECT COUNT(*) FROM "employees" WHERE "employees"."country" = ?  [["country", "India"]]
SELECT AVG("employees"."salary") FROM "employees" WHERE "employees"."country" = ? AND "employees"."job_title" = ?  [["country", "India"], ["job_title", "Manager"]]